In [1]:
# load packages
%matplotlib inline
import numpy as np
import scipy
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.formula.api as sm
import seaborn as sns
import re
from sqlalchemy import create_engine
import psycopg2
pd.set_option('display.float_format', lambda x: '%.3f' % x)

/Users/christina/.pyenv/versions/3.6.5/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [8]:
#read data
#df = pd.read_csv('C:/Users/Gongt/Desktop/SQL/Project/medicare.csv')
df = pd.read_csv('/Users/mehakkhara/Downloads/medicare.csv')

/opt/anaconda2/lib/python2.7/site-packages/IPython/core/interactiveshell.py:2714: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

## In this notebook:
-  ***Sanity check of the raw data***
-  ***Create SQL schema***
-  ***Create dataframes in python corresponding to tables in our schema***

*** We are currently using the first 10000 rows of the dataset, if we want to change the number of rows we wanted, we can just change the number of rows in 'test' below ***

# Part 0: Sanity Check #

In [9]:
df.head()

,NPI,NPPES Provider Last Name / Organization Name,NPPES Provider First Name,NPPES Provider Middle Initial,NPPES Credentials,NPPES Provider Gender,NPPES Entity Code,NPPES Provider Street Address 1,NPPES Provider Street Address 2,NPPES Provider City,...,Percent (%) of Beneficiaries Identified With Diabetes,Percent (%) of Beneficiaries Identified With Heart Failure,Percent (%) of Beneficiaries Identified With Hyperlipidemia,Percent (%) of Beneficiaries Identified With Hypertension,Percent (%) of Beneficiaries Identified With Ischemic Heart Disease,Percent (%) of Beneficiaries Identified With Osteoporosis,Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis,Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders,Percent (%) of Beneficiaries Identified With Stroke,Average HCC Risk Score of Beneficiaries
0,1003000126,ENKESHAFI,ARDALAN,NaN,M.D.,M,I,900 SETON DR,NaN,CUMBERLAND,...,54.0,50.0,70.0,75.0,67.0,13.0,47.0,16.0,20.0,2.1082
1,1003000134,CIBULL,THOMAS,L,M.D.,M,I,2650 RIDGE AVE,EVANSTON HOSPITAL,EVANSTON,...,20.0,11.0,57.0,60.0,29.0,8.0,36.0,1.0,4.0,1.0151
2,1003000142,KHALIL,RASHID,NaN,M.D.,M,I,4126 N HOLLAND SYLVANIA RD,SUITE 220,TOLEDO,...,51.0,19.0,53.0,72.0,40.0,NaN,74.0,NaN,NaN,1.5662
3,1003000407,GIRARDI,DAVID,J,D.O.,M,I,456 MAGEE AVE,NaN,PATTON,...,43.0,50.0,61.0,75.0,59.0,17.0,38.0,17.0,10.0,1.8967
4,1003000423,VELOTTA,JENNIFER,A,M.D.,F,I,11100 EUCLID AVE,NaN,CLEVELAND,...,30.0,NaN,43.0,57.0,22.0,NaN,30.0,NaN,0.0,1.1882

In [12]:
df.shape

(956293, 67)

In [13]:
# for the purpose of this project, we can use the first 10000 row of the original dataset as our data
test = df.head(10000)

In [14]:
test.shape

(10000, 67)

In [15]:
# print out all column names
test.columns

Index([u'NPI', u'NPPES Provider Last Name / Organization Name',
       u'NPPES Provider First Name', u'NPPES Provider Middle Initial',
       u'NPPES Credentials', u'NPPES Provider Gender', u'NPPES Entity Code',
       u'NPPES Provider Street Address 1', u'NPPES Provider Street Address 2',
       u'NPPES Provider City', u'NPPES Provider Zip Code',
       u'NPPES Provider State', u'NPPES Provider Country', u'Provider Type',
       u'Medicare Participation Indicator', u'Number of HCPCS',
       u'Number of Services', u'Number of Unique Beneficiaries',
       u'Total Submitted Charges', u'Total Medicare Allowed Amount',
       u'Total Medicare Payment Amount', u'Drug Suppress Indicator',
       u'Number of HCPCS Associated With Drug Services',
       u'Number of Drug Services',
       u'Number of Unique Beneficiaries With Drug Services',
       u'Total Drug Submitted Charges', u'Total Drug Medicare Allowed Amount',
       u'Total Drug Medicare Payment Amount', u'Medical Suppress Indicator',
       u'Number of HCPCS Associated With Medical Services',
       u'Number of Medical Services',
       u'Number of Unique Beneficiaries With Medical Services',
       u'Total Medical Submitted Charges',
       u'Total Medical Medicare Allowed Amount',
       u'Total Medical Medicare Payment Amount',
       u'Average Age of Beneficiaries',
       u'Number of Beneficiaries Age Less than 65',
       u'Number of Beneficiaries Age 65 to 74',
       u'Number of Beneficiaries Age 75 to 84',
       u'Number of Beneficiaries Age Greater 84',
       u'Number of Female Beneficiaries', u'Number of Male Beneficiaries',
       u'Number of Non-Hispanic White Beneficiaries',
       u'Number of Black or African American Beneficiaries',
       u'Number of Asian Pacific Islander Beneficiaries',
       u'Number of Hispanic Beneficiaries',
       u'Number of American Indian/Alaska Native Beneficiaries',
       u'Number of Beneficiaries With Race Not Elsewhere Classified',
       u'Number of Beneficiaries With Medicare Only Entitlement',
       u'Number of Beneficiaries With Medicare & Medicaid Entitlement',
       u'Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia',
       u'Percent (%) of Beneficiaries Identified With Asthma',
       u'Percent (%) of Beneficiaries Identified With Atrial Fibrillation',
       u'Percent (%) of Beneficiaries Identified With Cancer',
       u'Percent (%) of Beneficiaries Identified With Chronic Kidney Disease',
       u'Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease',
       u'Percent (%) of Beneficiaries Identified With Depression',
       u'Percent (%) of Beneficiaries Identified With Diabetes',
       u'Percent (%) of Beneficiaries Identified With Heart Failure',
       u'Percent (%) of Beneficiaries Identified With Hyperlipidemia',
       u'Percent (%) of Beneficiaries Identified With Hypertension',
       u'Percent (%) of Beneficiaries Identified With Ischemic Heart Disease',
       u'Percent (%) of Beneficiaries Identified With Osteoporosis',
       u'Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis',
       u'Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders',
       u'Percent (%) of Beneficiaries Identified With Stroke',
       u'Average HCC Risk Score of Beneficiaries'],
      dtype='object')

In [17]:
# rename NPI into provider_id
test= test.rename(columns={"NPI": "provider_id"})

In [18]:
#check if provider_id can be used as primary key, i.e. is it unique in our dataset
print('number of unique provider_id: ', test.provider_id.nunique())
print('number of rows: ', test.shape[0])

('number of unique provider_id: ', 10000)
('number of rows: ', 10000)

In [19]:
# NPI is assigned by unique pair of last name, first name, address1, and city
test[test[['NPPES Provider Last Name / Organization Name','NPPES Provider First Name','NPPES Provider Street Address 1','NPPES Provider City']].duplicated()==True]

Empty DataFrame
Columns: [provider_id, NPPES Provider Last Name / Organization Name, NPPES Provider First Name, NPPES Provider Middle Initial, NPPES Credentials, NPPES Provider Gender, NPPES Entity Code, NPPES Provider Street Address 1, NPPES Provider Street Address 2, NPPES Provider City, NPPES Provider Zip Code, NPPES Provider State, NPPES Provider Country, Provider Type, Medicare Participation Indicator, Number of HCPCS, Number of Services, Number of Unique Beneficiaries, Total Submitted Charges, Total Medicare Allowed Amount, Total Medicare Payment Amount, Drug Suppress Indicator, Number of HCPCS Associated With Drug Services, Number of Drug Services, Number of Unique Beneficiaries With Drug Services, Total Drug Submitted Charges, Total Drug Medicare Allowed Amount, Total Drug Medicare Payment Amount, Medical Suppress Indicator, Number of HCPCS Associated With Medical Services, Number of Medical Services, Number of Unique Beneficiaries With Medical Services, Total Medical Submitted Charges, Total Medical Medicare Allowed Amount, Total Medical Medicare Payment Amount, Average Age of Beneficiaries, Number of Beneficiaries Age Less than 65, Number of Beneficiaries Age 65 to 74, Number of Beneficiaries Age 75 to 84, Number of Beneficiaries Age Greater 84, Number of Female Beneficiaries, Number of Male Beneficiaries, Number of Non-Hispanic White Beneficiaries, Number of Black or African American Beneficiaries, Number of Asian Pacific Islander Beneficiaries, Number of Hispanic Beneficiaries, Number of American Indian/Alaska Native Beneficiaries, Number of Beneficiaries With Race Not Elsewhere Classified, Number of Beneficiaries With Medicare Only Entitlement, Number of Beneficiaries With Medicare & Medicaid Entitlement, Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia, Percent (%) of Beneficiaries Identified With Asthma, Percent (%) of Beneficiaries Identified With Atrial Fibrillation, Percent (%) of Beneficiaries Identified With Cancer, Percent (%) of Beneficiaries Identified With Chronic Kidney Disease, Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease, Percent (%) of Beneficiaries Identified With Depression, Percent (%) of Beneficiaries Identified With Diabetes, Percent (%) of Beneficiaries Identified With Heart Failure, Percent (%) of Beneficiaries Identified With Hyperlipidemia, Percent (%) of Beneficiaries Identified With Hypertension, Percent (%) of Beneficiaries Identified With Ischemic Heart Disease, Percent (%) of Beneficiaries Identified With Osteoporosis, Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis, Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders, Percent (%) of Beneficiaries Identified With Stroke, Average HCC Risk Score of Beneficiaries]
Index: []

[0 rows x 67 columns]

In [20]:
# CVS pharmacy as an organization has different NPI(provider_id) for its different location
test[test['NPPES Provider Last Name / Organization Name']=='CVS PHARMACY INC']

,provider_id,NPPES Provider Last Name / Organization Name,NPPES Provider First Name,NPPES Provider Middle Initial,NPPES Credentials,NPPES Provider Gender,NPPES Entity Code,NPPES Provider Street Address 1,NPPES Provider Street Address 2,NPPES Provider City,...,Percent (%) of Beneficiaries Identified With Diabetes,Percent (%) of Beneficiaries Identified With Heart Failure,Percent (%) of Beneficiaries Identified With Hyperlipidemia,Percent (%) of Beneficiaries Identified With Hypertension,Percent (%) of Beneficiaries Identified With Ischemic Heart Disease,Percent (%) of Beneficiaries Identified With Osteoporosis,Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis,Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders,Percent (%) of Beneficiaries Identified With Stroke,Average HCC Risk Score of Beneficiaries
2317,1003180704,CVS PHARMACY INC,NaN,NaN,NaN,NaN,O,100 E FM 495,NaN,SAN JUAN,...,37.0,NaN,68.0,74.0,38.0,NaN,47.0,0.0,NaN,0.8530
2485,1003248626,CVS PHARMACY INC,NaN,NaN,NaN,NaN,O,2 W CENTER ST,NaN,WEST BRIDGEWATER,...,NaN,NaN,63.0,67.0,NaN,0.0,NaN,NaN,NaN,1.0760
7691,1003910811,CVS PHARMACY INC,NaN,NaN,NaN,NaN,O,5212 ANTOINE DR,NaN,HOUSTON,...,32.0,NaN,54.0,64.0,39.0,NaN,35.0,NaN,NaN,1.0776
7780,1003913401,CVS PHARMACY INC,NaN,NaN,NaN,NaN,O,8754 SPRING CYPRESS RD,NaN,SPRING,...,24.0,17.0,59.0,59.0,39.0,NaN,32.0,NaN,NaN,0.9196
7855,1003915307,CVS PHARMACY INC,NaN,NaN,NaN,NaN,O,400 TREMONT ST,NaN,BOSTON,...,20.0,NaN,39.0,46.0,19.0,NaN,27.0,NaN,NaN,0.9862
7860,1003915463,CVS PHARMACY INC,NaN,NaN,NaN,NaN,O,74 E MAIN ST,NaN,WESTBOROUGH,...,15.0,7.0,49.0,55.0,24.0,NaN,28.0,NaN,NaN,0.8094
7861,1003915471,CVS PHARMACY INC,NaN,NaN,NaN,NaN,O,884 WASHINGTON ST # 886,NaN,BRAINTREE,...,24.0,NaN,50.0,61.0,21.0,NaN,32.0,0.0,NaN,0.9151

In [21]:
# check number of null values in each column
test.isnull().sum()

provider_id                                                                                  0
NPPES Provider Last Name / Organization Name                                                 0
NPPES Provider First Name                                                                  633
NPPES Provider Middle Initial                                                             2937
NPPES Credentials                                                                          897
NPPES Provider Gender                                                                      633
NPPES Entity Code                                                                            0
NPPES Provider Street Address 1                                                              0
NPPES Provider Street Address 2                                                           5865
NPPES Provider City                                                                          0
NPPES Provider Zip Code                                                                      0
NPPES Provider State                                                                         0
NPPES Provider Country                                                                       0
Provider Type                                                                                0
Medicare Participation Indicator                                                             0
Number of HCPCS                                                                              0
Number of Services                                                                           0
Number of Unique Beneficiaries                                                               0
Total Submitted Charges                                                                      0
Total Medicare Allowed Amount                                                                0
Total Medicare Payment Amount                                                                0
Drug Suppress Indicator                                                                   9011
Number of HCPCS Associated With Drug Services                                              989
Number of Drug Services                                                                    989
Number of Unique Beneficiaries With Drug Services                                          989
Total Drug Submitted Charges                                                               989
Total Drug Medicare Allowed Amount                                                         989
Total Drug Medicare Payment Amount                                                         989
Medical Suppress Indicator                                                                9011
Number of HCPCS Associated With Medical Services                                           989
                                                                                          ...
Number of Beneficiaries Age 65 to 74                                                      1600
Number of Beneficiaries Age 75 to 84                                                      2686
Number of Beneficiaries Age Greater 84                                                    3808
Number of Female Beneficiaries                                                            1064
Number of Male Beneficiaries                                                              1064
Number of Non-Hispanic White Beneficiaries                                                3311
Number of Black or African American Beneficiaries                                         6593
Number of Asian Pacific Islander Beneficiaries                                            8191
Number of Hispanic Beneficiaries                                                          7289
Number of American Indian/Alaska Native Beneficiaries                                     7138
Number of Beneficiaries With Race Not Elsewhere Classified                                8624
Number of Beneficiaries With Medicare Only Entitlement                                    2403
Number of Beneficiaries With Medicare & Medicaid Entitlement                              2403
Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia              3325
Percent (%) of Beneficiaries Identified With Asthma                                       3591
Percent (%) of Beneficiaries Identified With Atrial Fibrillation                          3140
Percent (%) of Beneficiaries Identified With Cancer                                       3193
Percent (%) of Beneficiaries Identified With Chronic Kidney Disease                       2105
Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease        2603
Percent (%) of Beneficiaries Identified With Depression                                   1609
Percent (%) of Beneficiaries Identified With Diabetes                                     1350
Percent (%) of Beneficiaries Identified With Heart Failure                                2401
Percent (%) of Beneficiaries Identified With Hyperlipidemia                                725
Percent (%) of Beneficiaries Identified With Hypertension                                  549
Percent (%) of Beneficiaries Identified With Ischemic Heart Disease                       1417
Percent (%) of Beneficiaries Identified With Osteoporosis                                 3598
Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis        1035
Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders    4725
Percent (%) of Beneficiaries Identified With Stroke                                       4392
Average HCC Risk Score of Beneficiaries                                                      0
Length: 67, dtype: int64

In [22]:
# columns without any null values, 
#if we are using the first 10000 rows of the original dataset, 
# the following columns should have 'NOT NULL' constraint
test.columns[test.isnull().sum()==0]

Index([u'provider_id', u'NPPES Provider Last Name / Organization Name',
       u'NPPES Entity Code', u'NPPES Provider Street Address 1',
       u'NPPES Provider City', u'NPPES Provider Zip Code',
       u'NPPES Provider State', u'NPPES Provider Country', u'Provider Type',
       u'Medicare Participation Indicator', u'Number of HCPCS',
       u'Number of Services', u'Number of Unique Beneficiaries',
       u'Total Submitted Charges', u'Total Medicare Allowed Amount',
       u'Total Medicare Payment Amount', u'Average Age of Beneficiaries',
       u'Average HCC Risk Score of Beneficiaries'],
      dtype='object')

In [23]:
# if we are using the raw dataset with 900000+ rows, 
# the following should have 'NOT NULL' constraint
df.columns[df.isnull().sum()==0]

Index([u'NPI', u'NPPES Entity Code', u'NPPES Provider Zip Code',
       u'NPPES Provider State', u'NPPES Provider Country', u'Provider Type',
       u'Medicare Participation Indicator', u'Number of HCPCS',
       u'Number of Services', u'Number of Unique Beneficiaries',
       u'Total Submitted Charges', u'Total Medicare Allowed Amount',
       u'Total Medicare Payment Amount', u'Average Age of Beneficiaries',
       u'Average HCC Risk Score of Beneficiaries'],
      dtype='object')

# Part 1: Create SQL table schema

In [2]:
conn_url = 'postgresql://postgres:kw59ok2p@f19server.apan5310.com:50209/sql_project'

In [3]:
# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

In [126]:
stmt = """

    CREATE TABLE provider_info (
        provider_id   integer NOT NULL,
        last_name varchar (100),
        first_name varchar (100),
        middle_name varchar (100),
        gender varchar (20),
        entity_code varchar(20),
        num_of_unique_beneficiaries integer, 
        PRIMARY KEY (provider_id)
        );

    CREATE TABLE credential(
        credential_id integer NOT NULL, 
        credential_type varchar (100) NOT NULL,
        PRIMARY KEY (credential_id)
        );

    CREATE TABLE provider_credential(
        provider_id integer, 
        credential_id integer,
        primary key (provider_id, credential_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (credential_id) REFERENCES credential (credential_id)
        );

    CREATE TABLE address(
        address_id integer NOT NULL,
        address varchar (100), 
        city varchar (100), 
        zipcode varchar (10), 
        state varchar (100),
        country varchar (100),
        PRIMARY KEY (address_id)
        );
        
    CREATE TABLE provider_address(
        provider_id integer,
        address_id  integer,
        PRIMARY KEY (provider_id,address_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (address_id) REFERENCES address (address_id)
        
        );
        
    CREATE TABLE amount_type (
        amount_type_id      integer NOT NULL,
        description   varchar(100) not null,
        PRIMARY KEY (amount_type_id)
        );
    
    CREATE TABLE amount (
        provider_id       integer,
        amount_type_id integer,
        value         numeric(11,3) NOT NULL,
        PRIMARY KEY (provider_id,amount_type_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (amount_type_id) REFERENCES amount_type (amount_type_id)
        );

    CREATE TABLE age (
        age_id   integer NOT NULL,
        age_group    varchar(50) NOT NULL,
        PRIMARY KEY (age_id)
        );
    
    CREATE TABLE beneficiary_age_info (
        provider_id    integer,
        age_id   integer,
        num_beneficiaries integer,
        PRIMARY KEY (provider_id,age_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (age_id) REFERENCES age (age_id)
        );
    
     CREATE TABLE ethnicity (
        ethnicity_id    integer NOT NULL,
        ethnicity     varchar(200) NOT NULL,
        PRIMARY KEY (ethnicity_id)
        );
    
    
     CREATE TABLE beneficiary_ethnicity_info (
        provider_id    integer,
        ethnicity_id   integer,
        num_beneficiaries integer,
        PRIMARY KEY (provider_id,ethnicity_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (ethnicity_id) REFERENCES ethnicity (ethnicity_id)
        );


     CREATE TABLE gender (
        gender_id    integer NOT NULL,
        gender    varchar(50) NOT NULL,
        PRIMARY KEY (gender_id)
        );
    
    
     CREATE TABLE beneficiary_gender_info (
        provider_id    integer,
        gender_id   integer,
        num_beneficiaries integer,
        PRIMARY KEY (provider_id,gender_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (gender_id) REFERENCES gender (gender_id)
        );
    
        CREATE TABLE disease (
        disease_id    integer NOT NULL,
        disease    varchar(500) NOT NULL,
        PRIMARY KEY (disease_id)
        );
    
    
     CREATE TABLE beneficiary_disease_info (
        provider_id    integer,
        disease_id   integer,
        percent_of_beneficiaries integer,
        PRIMARY KEY (provider_id,disease_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (disease_id) REFERENCES disease(disease_id)
        );
        
     CREATE TABLE service_type (
         service_id  integer NOT NULL,
         service_type varchar(250),
         PRIMARY KEY (service_id)
         );
    
     CREATE TABLE provider_service (
        service_id     integer,
        provider_id   integer,
        service_amount integer,
        PRIMARY KEY (service_id,provider_id),
        FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id),
        FOREIGN KEY (service_id) REFERENCES service_type (service_id)
        );
        
     CREATE TABLE index_type (
     index_id integer NOT NULL,
     index_type varchar(100),
     PRIMARY KEY (index_id)
     );
        
     CREATE TABLE provider_index_info (
     index_id integer,
     provider_id integer,
     index_value numeric(10,4),
     PRIMARY KEY (index_id, provider_id),
     FOREIGN KEY (index_id) REFERENCES index_type (index_id),
     FOREIGN KEY (provider_id) REFERENCES provider_info (provider_id)
     )
         
"""

In [ ]:
# Execute the statement to create tables
connection.execute(stmt)

# Part 2: Create tables in Python

## Provider_info table

In [27]:
# rename columns for the provider_info table
test= test.rename(columns={"NPPES Provider Last Name / Organization Name": "last_name",
                           "NPPES Provider First Name":"first_name",
                           "NPPES Provider Middle Initial":"Middle_name",
                           "NPPES Provider Gender":"gender",
                           "NPPES Entity Code":"entity_code",
                           "Number of Unique Beneficiaries":"num_of_unique_beneficiaries"})

In [28]:
# forming table
provider_info = test[['provider_id',
                      'last_name',
                      'first_name',
                      'gender',
                      'entity_code',
                      'num_of_unique_beneficiaries']]
provider_info.head()

,provider_id,last_name,first_name,gender,entity_code,num_of_unique_beneficiaries
0,1003000126,ENKESHAFI,ARDALAN,M,I,665
1,1003000134,CIBULL,THOMAS,M,I,3940
2,1003000142,KHALIL,RASHID,M,I,144
3,1003000407,GIRARDI,DAVID,M,I,436
4,1003000423,VELOTTA,JENNIFER,F,I,63

In [ ]:
#convert to sql
provider_info.to_sql(name='provider_info', con=engine, if_exists='append', index=False)

## Credential table

In [30]:
# Renaming NPPES Credentials'
test= test.rename(columns={"NPPES Credentials": "credential_type"})

In [31]:
# Assigning a Credential id to credential type
test = test.assign(credential_id=(test['credential_type'].astype('category').cat.codes))

##Dropping duplicates and creating a table
credential = test[['credential_type']].drop_duplicates()

In [32]:
# forming table and drop duplicates
credential = test[['credential_id','credential_type']].drop_duplicates()

In [33]:
#drop NAs
credential = credential.dropna()

In [35]:
credential.head()

   credential_id credential_type
0            219            M.D.
3            117            D.O.
5            273              MD
7            147              DO
8            378             OTR

In [ ]:
# convert to sql 
credential.to_sql(name='credential', con=engine, if_exists='append', index=False)

## Provider_credential

In [194]:
test.columns

Index(['provider_id', 'last_name', 'first_name', 'Middle_name',
       'credential_type', 'gender', 'entity_code',
       'NPPES Provider Street Address 1', 'NPPES Provider Street Address 2',
       'NPPES Provider City', 'NPPES Provider Zip Code',
       'NPPES Provider State', 'NPPES Provider Country', 'Provider Type',
       'Medicare Participation Indicator', 'Number of HCPCS',
       'Number of Services', 'num_of_unique_beneficiaries',
       'Total Submitted Charges', 'Total Medicare Allowed Amount',
       'Total Medicare Payment Amount', 'Drug Suppress Indicator',
       'Number of HCPCS Associated With Drug Services',
       'Number of Drug Services',
       'Number of Unique Beneficiaries With Drug Services',
       'Total Drug Submitted Charges', 'Total Drug Medicare Allowed Amount',
       'Total Drug Medicare Payment Amount', 'Medical Suppress Indicator',
       'Number of HCPCS Associated With Medical Services',
       'Number of Medical Services',
       'Number of Unique Beneficiaries With Medical Services',
       'Total Medical Submitted Charges',
       'Total Medical Medicare Allowed Amount',
       'Total Medical Medicare Payment Amount', 'Average Age of Beneficiaries',
       'Number of Beneficiaries Age Less than 65',
       'Number of Beneficiaries Age 65 to 74',
       'Number of Beneficiaries Age 75 to 84',
       'Number of Beneficiaries Age Greater 84',
       'Number of Female Beneficiaries', 'Number of Male Beneficiaries',
       'Number of Non-Hispanic White Beneficiaries',
       'Number of Black or African American Beneficiaries',
       'Number of Asian Pacific Islander Beneficiaries',
       'Number of Hispanic Beneficiaries',
       'Number of American Indian/Alaska Native Beneficiaries',
       'Number of Beneficiaries With Race Not Elsewhere Classified',
       'Number of Beneficiaries With Medicare Only Entitlement',
       'Number of Beneficiaries With Medicare & Medicaid Entitlement',
       'Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia',
       'Percent (%) of Beneficiaries Identified With Asthma',
       'Percent (%) of Beneficiaries Identified With Atrial Fibrillation',
       'Percent (%) of Beneficiaries Identified With Cancer',
       'Percent (%) of Beneficiaries Identified With Chronic Kidney Disease',
       'Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease',
       'Percent (%) of Beneficiaries Identified With Depression',
       'Percent (%) of Beneficiaries Identified With Diabetes',
       'Percent (%) of Beneficiaries Identified With Heart Failure',
       'Percent (%) of Beneficiaries Identified With Hyperlipidemia',
       'Percent (%) of Beneficiaries Identified With Hypertension',
       'Percent (%) of Beneficiaries Identified With Ischemic Heart Disease',
       'Percent (%) of Beneficiaries Identified With Osteoporosis',
       'Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis',
       'Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders',
       'Percent (%) of Beneficiaries Identified With Stroke',
       'Average HCC Risk Score of Beneficiaries', 'credential_id'],
      dtype='object')

In [36]:
# prevent assigning -1 credential_id to provider_id due to non-existence of credential_type
provider_credential = test[['provider_id','credential_id','credential_type']]
provider_credential = provider_credential.dropna()

# reform provider_credential
provider_credential = provider_credential[['provider_id','credential_id']]
provider_credential.head()

   provider_id  credential_id
0   1003000126            219
1   1003000134            219
2   1003000142            219
3   1003000407            117
4   1003000423            219

In [64]:
# convert to sql 
provider_credential.to_sql(name='provider_credential', con=engine, if_exists='append', index=False)

## Address table and Provider_address table

## Address Table

In [47]:
# rename "NPPES Provider Street Address 1" to "address 1".
# rename "NPPES Provider Street Address 2" to "address 2".
# rename "NPPES Provider City" to "city".
# rename "NPPES Provider Zip Code" to "zip code".
# rename "NPPES Provider State" to "state".
# rename "NPPES Provider Country" to "country".
test= test.rename(columns={"NPPES Provider Street Address 1" : "address 1",
                     "NPPES Provider Street Address 2" : "address 2",
                     "NPPES Provider City" : "city",
                     "NPPES Provider Zip Code" : "zipcode",
                     "NPPES Provider State" : "state",
                     "NPPES Provider Country" : "country"})

In [48]:
# replacing the NaNs in address 2 
test['address'] = test["address 2"].fillna(" ", inplace = True)

In [49]:
# combine "address 1" and "address 2"
test['address'] = test['address 1'].astype(str) + ' ' + test['address 2']

In [50]:
test.columns

Index([u'provider_id', u'last_name', u'first_name', u'Middle_name',
       u'credential_type', u'gender', u'entity_code', u'address 1',
       u'address 2', u'city', u'zipcode', u'state', u'country',
       u'Provider Type', u'Medicare Participation Indicator',
       u'Number of HCPCS', u'Number of Services',
       u'num_of_unique_beneficiaries', u'Total Submitted Charges',
       u'Total Medicare Allowed Amount', u'Total Medicare Payment Amount',
       u'Drug Suppress Indicator',
       u'Number of HCPCS Associated With Drug Services',
       u'Number of Drug Services',
       u'Number of Unique Beneficiaries With Drug Services',
       u'Total Drug Submitted Charges', u'Total Drug Medicare Allowed Amount',
       u'Total Drug Medicare Payment Amount', u'Medical Suppress Indicator',
       u'Number of HCPCS Associated With Medical Services',
       u'Number of Medical Services',
       u'Number of Unique Beneficiaries With Medical Services',
       u'Total Medical Submitted Charges',
       u'Total Medical Medicare Allowed Amount',
       u'Total Medical Medicare Payment Amount',
       u'Average Age of Beneficiaries',
       u'Number of Beneficiaries Age Less than 65',
       u'Number of Beneficiaries Age 65 to 74',
       u'Number of Beneficiaries Age 75 to 84',
       u'Number of Beneficiaries Age Greater 84',
       u'Number of Female Beneficiaries', u'Number of Male Beneficiaries',
       u'Number of Non-Hispanic White Beneficiaries',
       u'Number of Black or African American Beneficiaries',
       u'Number of Asian Pacific Islander Beneficiaries',
       u'Number of Hispanic Beneficiaries',
       u'Number of American Indian/Alaska Native Beneficiaries',
       u'Number of Beneficiaries With Race Not Elsewhere Classified',
       u'Number of Beneficiaries With Medicare Only Entitlement',
       u'Number of Beneficiaries With Medicare & Medicaid Entitlement',
       u'Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia',
       u'Percent (%) of Beneficiaries Identified With Asthma',
       u'Percent (%) of Beneficiaries Identified With Atrial Fibrillation',
       u'Percent (%) of Beneficiaries Identified With Cancer',
       u'Percent (%) of Beneficiaries Identified With Chronic Kidney Disease',
       u'Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease',
       u'Percent (%) of Beneficiaries Identified With Depression',
       u'Percent (%) of Beneficiaries Identified With Diabetes',
       u'Percent (%) of Beneficiaries Identified With Heart Failure',
       u'Percent (%) of Beneficiaries Identified With Hyperlipidemia',
       u'Percent (%) of Beneficiaries Identified With Hypertension',
       u'Percent (%) of Beneficiaries Identified With Ischemic Heart Disease',
       u'Percent (%) of Beneficiaries Identified With Osteoporosis',
       u'Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis',
       u'Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders',
       u'Percent (%) of Beneficiaries Identified With Stroke',
       u'Average HCC Risk Score of Beneficiaries', u'credential_id',
       u'address', u'address_id'],
      dtype='object')

In [51]:
# assign unique address_id based on provider_id and address
test = test.assign(address_id=(test['provider_id']).astype('category').cat.codes)

In [52]:
# forming address table and drop duplicates
address_df = test[['provider_id', 'address_id','address', 'city', 'zipcode', 'state', 'country']].drop_duplicates()

In [53]:
address = address_df[['address_id','address', 'city', 'zipcode', 'state', 'country']]

In [54]:
address = address.drop_duplicates()
#address = address.dropna()
address[address.address_id == 6733]

      address_id                     address     city zipcode state country
6733        6733  2121 MAIN STREET SUITE 316  BUFFALO   14214    NY      US

In [128]:
# convert to sql 
address.to_sql(name='address', con=engine, if_exists='append', index=False)

## Provider Address Table

In [133]:
# combine provider_id and address_id to form provider_address
provider_address = test[['provider_id','address_id']].drop_duplicates()
provider_address = provider_address.drop_duplicates()
provider_address = provider_address.dropna()
provider_address.head()

   provider_id  address_id
0   1003000126           0
1   1003000134           1
2   1003000142           2
3   1003000381           3
4   1003000407           4

In [134]:
provider_address

      provider_id  address_id
0      1003000126           0
1      1003000134           1
2      1003000142           2
3      1003000381           3
4      1003000407           4
5      1003000423           5
6      1003000449           6
7      1003000480           7
8      1003000522           8
9      1003000530           9
10     1003000605          10
11     1003000621          11
12     1003000639          12
13     1003000704          13
14     1003000712          14
15     1003000720          15
16     1003000738          16
17     1003000902          17
18     1003000936          18
19     1003001017          19
20     1003001041          20
21     1003001249          21
22     1003001256          22
23     1003001322          23
24     1003001363          24
25     1003001371          25
26     1003001405          26
27     1003001462          27
28     1003001587          28
29     1003001645          29
...           ...         ...
9970   1013018308        9970
9971   1013018357        9971
9972   1013018373        9972
9973   1013018381        9973
9974   1013018415        9974
9975   1013018431        9975
9976   1013018449        9976
9977   1013018514        9977
9978   1013018548        9978
9979   1013018555        9979
9980   1013018597        9980
9981   1013018605        9981
9982   1013018613        9982
9983   1013018654        9983
9984   1013018670        9984
9985   1013018704        9985
9986   1013018761        9986
9987   1013018795        9987
9988   1013018829        9988
9989   1013018837        9989
9990   1013018845        9990
9991   1013018886        9991
9992   1013018894        9992
9993   1013018902        9993
9994   1013018944        9994
9995   1013018993        9995
9996   1013019009        9996
9997   1013019017        9997
9998   1013019025        9998
9999   1013019033        9999

[10000 rows x 2 columns]

In [136]:
# convert to sql 
provider_address.to_sql(name='provider_address', con=engine, if_exists='append', index=False)

# Amount and Amount_type table

In [80]:
# extract related columns from original data
Medicare_spending = test[['provider_id',
                          'Total Submitted Charges',
                          'Total Medicare Allowed Amount',
                          'Total Medicare Payment Amount',
                          'Total Medical Submitted Charges',
                          'Total Medical Medicare Allowed Amount',
                          'Total Medical Medicare Payment Amount',
                          'Total Drug Submitted Charges',
                          'Total Drug Medicare Allowed Amount',
                          'Total Drug Medicare Payment Amount']]

In [81]:
# take a look
Medicare_spending.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 10 columns):
provider_id                              10000 non-null int64
Total Submitted Charges                  10000 non-null float64
Total Medicare Allowed Amount            10000 non-null float64
Total Medicare Payment Amount            10000 non-null float64
Total Medical Submitted Charges          9011 non-null float64
Total Medical Medicare Allowed Amount    9011 non-null float64
Total Medical Medicare Payment Amount    9011 non-null float64
Total Drug Submitted Charges             9011 non-null float64
Total Drug Medicare Allowed Amount       9011 non-null float64
Total Drug Medicare Payment Amount       9011 non-null float64
dtypes: float64(9), int64(1)
memory usage: 781.3 KB

In [82]:
# show all records that have na in Total Medical Medicare Allowed Amount.
Medicare_spending[Medicare_spending['Total Medical Medicare Allowed Amount'].isnull()]

,provider_id,Total Submitted Charges,Total Medicare Allowed Amount,Total Medicare Payment Amount,Total Medical Submitted Charges,Total Medical Medicare Allowed Amount,Total Medical Medicare Payment Amount,Total Drug Submitted Charges,Total Drug Medicare Allowed Amount,Total Drug Medicare Payment Amount
4,1003000423,31637.00,13393.05,10320.43,NaN,NaN,NaN,NaN,NaN,NaN
6,1003000522,173219.65,138260.09,95967.37,NaN,NaN,NaN,NaN,NaN,NaN
27,1003001645,133631.00,46854.25,35799.99,NaN,NaN,NaN,NaN,NaN,NaN
35,1003002379,29104.00,12105.36,9297.49,NaN,NaN,NaN,NaN,NaN,NaN
39,1003002627,164680.00,70773.18,55048.12,NaN,NaN,NaN,NaN,NaN,NaN
70,1003005372,157273.00,47641.78,37287.22,NaN,NaN,NaN,NaN,NaN,NaN
76,1003006107,241351.49,81680.72,63409.81,NaN,NaN,NaN,NaN,NaN,NaN
79,1003006172,264972.86,132455.92,103498.11,NaN,NaN,NaN,NaN,NaN,NaN
102,1003007287,167098.38,55363.14,37135.83,NaN,NaN,NaN,NaN,NaN,NaN
113,1003007741,17714.00,9742.46,7016.19,NaN,NaN,NaN,NaN,NaN,NaN
115,1003007816,179957.50,134829.56,96606.91,NaN,NaN,NaN,NaN,NaN,NaN
120,1003007998,9509.70,5427.99,4311.23,NaN,NaN,NaN,NaN,NaN,NaN
134,1003009127,8179.21,8046.11,5679.56,NaN,NaN,NaN,NaN,NaN,NaN
135,1003009135,26045.00,14121.12,10824.65,NaN,NaN,NaN,NaN,NaN,NaN
136,1003009176,96561.00,27602.93,20115.34,NaN,NaN,NaN,NaN,NaN,NaN
137,1003009218,31803.00,15036.18,11536.86,NaN,NaN,NaN,NaN,NaN,NaN
142,1003009630,652199.00,131280.74,101625.91,NaN,NaN,NaN,NaN,NaN,NaN
147,1003009861,111029.09,42255.42,33142.52,NaN,NaN,NaN,NaN,NaN,NaN
170,1003010752,12730.00,7324.39,5469.83,NaN,NaN,NaN,NaN,NaN,NaN
175,1003010893,34348.00,12064.27,6148.24,NaN,NaN,NaN,NaN,NaN,NaN
189,1003011578,910288.25,154673.03,116606.68,NaN,NaN,NaN,NaN,NaN,NaN
202,1003012113,13872.36,4657.02,2869.84,NaN,NaN,NaN,NaN,NaN,NaN
207,1003012303,33268.13,12807.40,10031.86,NaN,NaN,NaN,NaN,NaN,NaN
213,1003012477,223343.00,92109.29,71532.37,NaN,NaN,NaN,NaN,NaN,NaN
214,1003012493,32064.00,17598.67,12573.49,NaN,NaN,NaN,NaN,NaN,NaN
218,1003012642,233152.35,104533.61,77257.00,NaN,NaN,NaN,NaN,NaN,NaN
221,1003012907,83252.00,43799.02,33268.09,NaN,NaN,NaN,NaN,NaN,NaN
224,1003012949,93636.00,24134.18,18563.21,NaN,NaN,NaN,NaN,NaN,NaN
228,1003013020,170004.75,51391.12,41984.55,NaN,NaN,NaN,NaN,NaN,NaN
230,1003013079,28720.00,16651.25,12114.04,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
9651,1003999376,11380.00,1774.01,1485.73,NaN,NaN,NaN,NaN,NaN,NaN
9656,1003999582,42555.00,16854.07,13089.47,NaN,NaN,NaN,NaN,NaN,NaN
9688,1013000660,284960.00,81116.18,61677.76,NaN,NaN,NaN,NaN,NaN,NaN
9691,1013000769,217104.00,72434.36,54757.27,NaN,NaN,NaN,NaN,NaN,NaN
9694,1013000843,766162.34,141032.56,109130.78,NaN,NaN,NaN,NaN,NaN,NaN
9697,1013000892,382438.00,241503.16,167099.85,NaN,NaN,NaN,NaN,NaN,NaN
9701,1013001148,233747.00,166550.18,123182.78,NaN,NaN,NaN,NaN,NaN,NaN
9703,1013001288,64065.00,24190.72,18222.14,NaN,NaN,NaN,NaN,NaN,NaN
9708,1013001478,177735.46,177127.90,133493.85,NaN,NaN,NaN,NaN,NaN,NaN
9712,1013001619,371412.25,160171.43,123811.90,NaN,NaN,NaN,NaN,NaN,NaN
9720,1013001841,461004.00,224147.20,159639.39,NaN,NaN,NaN,NaN,NaN,NaN
9734,1013002435,65225.00,48742.50,32547.29,NaN,NaN,NaN,NaN,NaN,NaN
9759,1013003136,641480.00,519113.57,369135.25,NaN,NaN,NaN,NaN,NaN,NaN
9761,1013003201,4235.00,1606.97,875.37,NaN,NaN,NaN,NaN,NaN,NaN
9781,1013003805,33613.00,13000.67,9533.16,NaN,NaN,NaN,NaN,NaN,NaN
9796,1013004530,225922.81,97892.08,75004.50,NaN,NaN,NaN,NaN,NaN,NaN
9797,1013004555,62903.00,23884.42,17075.26,NaN,NaN,NaN,NaN,NaN,NaN
9833,1013005982,191783.00,45643.48,33086.54,NaN,NaN,NaN,NaN,NaN,NaN
9845,1013006451,61039.40,8142.99,5802.22,NaN,NaN,NaN,NaN,NaN,NaN
9847,1013006527,2887.00,1686.32,753.56,NaN,NaN,NaN,NaN,NaN,NaN
9849,1013006592,421948.00,223732.42,166518.74,NaN,NaN,NaN,NaN,NaN,NaN
9860,1013006931,16113.44,5123.69,4871.64,NaN,NaN,NaN,NaN,NaN,NaN
9898,1013008150,16309.00,3946.22,2879.39,NaN,NaN,NaN,NaN,NaN,NaN
9900,1013008184,350095.00,88424.03,67816.19,NaN,NaN,NaN,NaN,NaN,NaN
9908,1013008390,44456.00,32101.89,20876.14,NaN,NaN,NaN,NaN,NaN,NaN
9924,1013008754,760363.00,189294.54,150313.34,NaN,NaN,NaN,NaN,NaN,NaN
9933,1013009067,33310.00,25042.44,16217.38,NaN,NaN,NaN,NaN,NaN,NaN
9939,1013009265,3640.00,1983.13,1369.32,NaN,NaN,NaN,NaN,NaN,NaN
9961,1013009950,174795.00,96332.55,71433.11,NaN,NaN,NaN,NaN,NaN,NaN
9986,1013010685,379161.24,228087.18,174241.10,NaN,NaN,NaN,NaN,NaN,NaN

In [83]:
# transpose the table
amount = Medicare_spending.melt(id_vars='provider_id', value_name='value', var_name='amount_type')

# take a look at output for Total Drug Submitted Charges
amount[amount['amount_type']=="Total Drug Submitted Charges"]

       provider_id                   amount_type      value
60000   1003000126  Total Drug Submitted Charges       0.00
60001   1003000134  Total Drug Submitted Charges       0.00
60002   1003000142  Total Drug Submitted Charges       0.00
60003   1003000407  Total Drug Submitted Charges       0.00
60004   1003000423  Total Drug Submitted Charges        NaN
60005   1003000480  Total Drug Submitted Charges       0.00
60006   1003000522  Total Drug Submitted Charges        NaN
60007   1003000530  Total Drug Submitted Charges    8592.00
60008   1003000605  Total Drug Submitted Charges       0.00
60009   1003000621  Total Drug Submitted Charges       0.00
60010   1003000639  Total Drug Submitted Charges       0.00
60011   1003000704  Total Drug Submitted Charges       0.00
60012   1003000712  Total Drug Submitted Charges       0.00
60013   1003000720  Total Drug Submitted Charges    2390.00
60014   1003000738  Total Drug Submitted Charges     760.00
60015   1003000753  Total Drug Submitted Charges       0.00
60016   1003000902  Total Drug Submitted Charges     662.00
60017   1003000936  Total Drug Submitted Charges       0.00
60018   1003001017  Total Drug Submitted Charges   28250.00
60019   1003001041  Total Drug Submitted Charges       0.00
60020   1003001249  Total Drug Submitted Charges       0.00
60021   1003001256  Total Drug Submitted Charges       0.00
60022   1003001322  Total Drug Submitted Charges   12554.99
60023   1003001363  Total Drug Submitted Charges  101267.20
60024   1003001371  Total Drug Submitted Charges   82700.00
60025   1003001462  Total Drug Submitted Charges       0.00
60026   1003001587  Total Drug Submitted Charges       0.00
60027   1003001645  Total Drug Submitted Charges        NaN
60028   1003001785  Total Drug Submitted Charges   33962.00
60029   1003001843  Total Drug Submitted Charges       0.00
...            ...                           ...        ...
69970   1013010305  Total Drug Submitted Charges   34282.10
69971   1013010313  Total Drug Submitted Charges    4145.00
69972   1013010388  Total Drug Submitted Charges       0.00
69973   1013010396  Total Drug Submitted Charges       0.00
69974   1013010479  Total Drug Submitted Charges     726.16
69975   1013010487  Total Drug Submitted Charges       0.00
69976   1013010503  Total Drug Submitted Charges       0.00
69977   1013010511  Total Drug Submitted Charges       0.00
69978   1013010545  Total Drug Submitted Charges       0.00
69979   1013010552  Total Drug Submitted Charges     943.40
69980   1013010560  Total Drug Submitted Charges    5300.00
69981   1013010586  Total Drug Submitted Charges    8540.00
69982   1013010594  Total Drug Submitted Charges       0.00
69983   1013010602  Total Drug Submitted Charges       0.00
69984   1013010628  Total Drug Submitted Charges       0.00
69985   1013010636  Total Drug Submitted Charges       0.00
69986   1013010685  Total Drug Submitted Charges        NaN
69987   1013010701  Total Drug Submitted Charges    2370.74
69988   1013010719  Total Drug Submitted Charges    2964.60
69989   1013010735  Total Drug Submitted Charges    2386.78
69990   1013010743  Total Drug Submitted Charges    1704.31
69991   1013010750  Total Drug Submitted Charges    6660.50
69992   1013010768  Total Drug Submitted Charges    1423.73
69993   1013010776  Total Drug Submitted Charges    3043.30
69994   1013010784  Total Drug Submitted Charges    5850.71
69995   1013010792  Total Drug Submitted Charges    6642.37
69996   1013010800  Total Drug Submitted Charges       0.00
69997   1013010834  Total Drug Submitted Charges    3449.61
69998   1013010842  Total Drug Submitted Charges    2022.73
69999   1013010859  Total Drug Submitted Charges     744.05

[10000 rows x 3 columns]

In [84]:
# Create temporary dataframe with unique amount type
amount_type = pd.DataFrame(amount.amount_type.unique(), columns=['description'])

# Add incrementing integers
amount_type.insert(0, 'amount_type_id', range(1, 1 + len(amount_type)))
amount_type

   amount_type_id                            description
0               1                Total Submitted Charges
1               2          Total Medicare Allowed Amount
2               3          Total Medicare Payment Amount
3               4        Total Medical Submitted Charges
4               5  Total Medical Medicare Allowed Amount
5               6  Total Medical Medicare Payment Amount
6               7           Total Drug Submitted Charges
7               8     Total Drug Medicare Allowed Amount
8               9     Total Drug Medicare Payment Amount

In [86]:
# convert to sql
amount_type.to_sql(name='amount_type', con=engine, if_exists='append', index=False)

In [87]:
# Map amount_type_id
amount_type_id_list = [amount_type.amount_type_id[amount_type.description == i].values[0] for i in amount.amount_type]

# Add spend_id to the charge_df
amount.insert(2, 'amount_type_id', amount_type_id_list)
amount.head()

   provider_id              amount_type  amount_type_id      value
0   1003000126  Total Submitted Charges               1   395335.0
1   1003000134  Total Submitted Charges               1  1211595.0
2   1003000142  Total Submitted Charges               1   197224.0
3   1003000407  Total Submitted Charges               1   240818.0
4   1003000423  Total Submitted Charges               1    31637.0

In [88]:
# update amount table
amount = amount[['provider_id','amount_type_id','value']] 
amount.head()

   provider_id  amount_type_id      value
0   1003000126               1   395335.0
1   1003000134               1  1211595.0
2   1003000142               1   197224.0
3   1003000407               1   240818.0
4   1003000423               1    31637.0

In [89]:
# drop the na rows
amount = amount.dropna()
# to add a new record, we just need to type in an amount, an amount type and the provider_id. And we won't have NA in our design.

In [90]:
# convert to sql
amount.to_sql(name='amount', con=engine, if_exists='append', index=False)

## Age table + Beneficiary_age_info table

## Age Table

In [91]:
# find all related columns
age_cols = [line for line in list(test.columns) if re.search("Number of Beneficiaries Age",line)]

In [92]:
age_cols.append('provider_id')
age_cols

['Number of Beneficiaries Age Less than 65',
 'Number of Beneficiaries Age 65 to 74',
 'Number of Beneficiaries Age 75 to 84',
 'Number of Beneficiaries Age Greater 84',
 'provider_id']

In [93]:
# age group df
age_df = test[age_cols]
age_df.head()

,Number of Beneficiaries Age Less than 65,Number of Beneficiaries Age 65 to 74,Number of Beneficiaries Age 75 to 84,Number of Beneficiaries Age Greater 84,provider_id
0,120.0,186.0,205.0,154.0,1003000126
1,100.0,1669.0,1472.0,699.0,1003000134
2,76.0,36.0,20.0,12.0,1003000142
3,65.0,97.0,137.0,137.0,1003000407
4,35.0,13.0,NaN,NaN,1003000423

In [94]:
# going from wide to long data
age_df = age_df.melt(id_vars='provider_id', value_name='num_beneficiaries', var_name='age_group')
age_df.head()

   provider_id                                 age_group  num_beneficiaries
0   1003000126  Number of Beneficiaries Age Less than 65              120.0
1   1003000134  Number of Beneficiaries Age Less than 65              100.0
2   1003000142  Number of Beneficiaries Age Less than 65               76.0
3   1003000407  Number of Beneficiaries Age Less than 65               65.0
4   1003000423  Number of Beneficiaries Age Less than 65               35.0

In [95]:
# extract age group info from 'Number of Beneficiaries Age Less than 65'
age_df['age_group'] = age_df.age_group.str.replace("Number of Beneficiaries Age ", "")
age_df.head()

   provider_id     age_group  num_beneficiaries
0   1003000126  Less than 65              120.0
1   1003000134  Less than 65              100.0
2   1003000142  Less than 65               76.0
3   1003000407  Less than 65               65.0
4   1003000423  Less than 65               35.0

In [96]:
# step 1: assign unique age_id 
age_df = age_df.assign(age_id=(age_df['age_group'].astype('category').cat.codes))
age_df.head()

   provider_id     age_group  num_beneficiaries  age_id
0   1003000126  Less than 65              120.0       3
1   1003000134  Less than 65              100.0       3
2   1003000142  Less than 65               76.0       3
3   1003000407  Less than 65               65.0       3
4   1003000423  Less than 65               35.0       3

In [97]:
# step 2: break age_df into age table and beneficiary_age_info table
age = age_df[['age_id','age_group']].drop_duplicates()
age

       age_id     age_group
0           3  Less than 65
10000       0      65 to 74
20000       1      75 to 84
30000       2    Greater 84

## Beneficiary_age_info tableÂ¶

In [30]:
# each provider_id has four records in this table corresponding to four different age groups
beneficiary_age_info = age_df[['provider_id','age_id','num_beneficiaries']].drop_duplicates()
beneficiary_age_info.sort_values(by = 'provider_id')

       provider_id  age_id  num_beneficiaries
0       1003000126       3             89.000
10000   1003000126       0            141.000
30000   1003000126       2            164.000
20000   1003000126       1            187.000
10001   1003000134       0           1594.000
1       1003000134       3             93.000
20001   1003000134       1           1454.000
30001   1003000134       2            683.000
10002   1003000142       0             43.000
2       1003000142       3             41.000
30002   1003000142       2             13.000
20002   1003000142       1             22.000
30003   1003000381       2                nan
10003   1003000381       0             19.000
3       1003000381       3                nan
20003   1003000381       1                nan
10004   1003000407       0             92.000
30004   1003000407       2            137.000
20004   1003000407       1            163.000
4       1003000407       3             52.000
20005   1003000423       1                nan
5       1003000423       3             41.000
10005   1003000423       0             14.000
30005   1003000423       2                nan
10006   1003000449       0                nan
20006   1003000449       1                nan
30006   1003000449       2                nan
6       1003000449       3                nan
7       1003000480       3             47.000
10007   1003000480       0             41.000
...            ...     ...                ...
29992   1013018894       1             25.000
19992   1013018894       0             48.000
29993   1013018902       1             16.000
9993    1013018902       3                nan
39993   1013018902       2                nan
19993   1013018902       0             25.000
19994   1013018944       0                nan
39994   1013018944       2                nan
29994   1013018944       1                nan
9994    1013018944       3                nan
39995   1013018993       2             59.000
29995   1013018993       1            127.000
19995   1013018993       0            150.000
9995    1013018993       3             20.000
29996   1013019009       1            265.000
19996   1013019009       0            317.000
9996    1013019009       3             46.000
39996   1013019009       2             62.000
29997   1013019017       1            116.000
39997   1013019017       2             84.000
9997    1013019017       3             31.000
19997   1013019017       0            105.000
29998   1013019025       1            163.000
39998   1013019025       2             77.000
19998   1013019025       0            147.000
9998    1013019025       3             23.000
19999   1013019033       0            345.000
9999    1013019033       3            239.000
29999   1013019033       1            340.000
39999   1013019033       2            187.000

[40000 rows x 3 columns]

In [31]:
# convert to sql 
age.to_sql(name='age', con=engine, if_exists='append', index=False)

In [32]:
# convert to sql
beneficiary_age_info.to_sql(name='beneficiary_age_info', con=engine, if_exists='append', index=False)

# Ethnicity table + Beneficiary_ethnicity_info table

## Ethnicity table

In [98]:
# find all related columns
all_cols = [line for line in list(test.columns) if re.search("Number of .* Beneficiaries$",line)]
ethn_cols = all_cols[3:]
ethn_cols

['Number of Black or African American Beneficiaries',
 'Number of Asian Pacific Islander Beneficiaries',
 'Number of Hispanic Beneficiaries',
 'Number of American Indian/Alaska Native Beneficiaries']

In [34]:
ethn_cols.append('provider_id')
ethn_cols

['Number of Non-Hispanic White Beneficiaries',
 'Number of Black or African American Beneficiaries',
 'Number of Asian Pacific Islander Beneficiaries',
 'Number of Hispanic Beneficiaries',
 'Number of American Indian/Alaska Native Beneficiaries',
 'provider_id']

In [35]:
# ethnicity reference table
ethn_df = test[ethn_cols]
ethn_df.head()

,Number of Non-Hispanic White Beneficiaries,Number of Black or African American Beneficiaries,Number of Asian Pacific Islander Beneficiaries,Number of Hispanic Beneficiaries,Number of American Indian/Alaska Native Beneficiaries,provider_id
0,564.000,nan,nan,nan,0.000,1003000126
1,3677.000,33.000,37.000,56.000,nan,1003000134
2,88.000,nan,nan,nan,nan,1003000142
3,nan,nan,nan,nan,nan,1003000381
4,nan,nan,nan,nan,nan,1003000407

In [36]:
# going from wide to long data
ethn_df = ethn_df.melt(id_vars='provider_id', value_name='num_beneficiaries', var_name='ethnicity')
ethn_df.head()

   provider_id                                   ethnicity  num_beneficiaries
0   1003000126  Number of Non-Hispanic White Beneficiaries            564.000
1   1003000134  Number of Non-Hispanic White Beneficiaries           3677.000
2   1003000142  Number of Non-Hispanic White Beneficiaries             88.000
3   1003000381  Number of Non-Hispanic White Beneficiaries                nan
4   1003000407  Number of Non-Hispanic White Beneficiaries                nan

In [37]:
# extract ethnicity info from 'Number of Non-Hispanic White Beneficiaries'
ethn_df['ethnicity'] = ethn_df.ethnicity.str.replace("Number of ", "")
ethn_df['ethnicity'] = ethn_df.ethnicity.str.replace(" Beneficiaries", "")
ethn_df.head()

   provider_id           ethnicity  num_beneficiaries
0   1003000126  Non-Hispanic White            564.000
1   1003000134  Non-Hispanic White           3677.000
2   1003000142  Non-Hispanic White             88.000
3   1003000381  Non-Hispanic White                nan
4   1003000407  Non-Hispanic White                nan

In [38]:
# step 1: assign unique ethicity_id 
ethn_df = ethn_df.assign(ethnicity_id=(ethn_df['ethnicity'].astype('category').cat.codes))
ethn_df.head()

   provider_id           ethnicity  num_beneficiaries  ethnicity_id
0   1003000126  Non-Hispanic White            564.000             4
1   1003000134  Non-Hispanic White           3677.000             4
2   1003000142  Non-Hispanic White             88.000             4
3   1003000381  Non-Hispanic White                nan             4
4   1003000407  Non-Hispanic White                nan             4

In [39]:
# step 2: break ethn_df into ethnicity table and beneficiary_ethnicity_info table
ethnicity = ethn_df[['ethnicity_id','ethnicity']].drop_duplicates()
ethnicity

       ethnicity_id                      ethnicity
0                 4             Non-Hispanic White
10000             2      Black or African American
20000             1         Asian Pacific Islander
30000             3                       Hispanic
40000             0  American Indian/Alaska Native

## Beneficiary_ethnicity_info table

In [40]:
# create beneficiary_ethnicity_info table
beneficiary_ethnicity_info = ethn_df[['provider_id','ethnicity_id','num_beneficiaries']].drop_duplicates()

In [41]:
beneficiary_ethnicity_info.head()

   provider_id  ethnicity_id  num_beneficiaries
0   1003000126             4            564.000
1   1003000134             4           3677.000
2   1003000142             4             88.000
3   1003000381             4                nan
4   1003000407             4                nan

In [42]:
# convert to sql
ethnicity.to_sql(name='ethnicity', con=engine, if_exists='append', index=False)

In [43]:
# convert to sql
beneficiary_ethnicity_info.to_sql(name='beneficiary_ethnicity_info', con=engine, if_exists='append', index=False)

# Disease table + beneficiary_disease_info table

## Disease table

In [44]:
# find all related columns
disease_cols = [line for line in list(test.columns) if re.search("^Percent",line)]
disease_cols

['Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia',
 'Percent (%) of Beneficiaries Identified With Asthma',
 'Percent (%) of Beneficiaries Identified With Atrial Fibrillation',
 'Percent (%) of Beneficiaries Identified With Cancer',
 'Percent (%) of Beneficiaries Identified With Chronic Kidney Disease',
 'Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease',
 'Percent (%) of Beneficiaries Identified With Depression',
 'Percent (%) of Beneficiaries Identified With Diabetes',
 'Percent (%) of Beneficiaries Identified With Heart Failure',
 'Percent (%) of Beneficiaries Identified With Hyperlipidemia',
 'Percent (%) of Beneficiaries Identified With Hypertension',
 'Percent (%) of Beneficiaries Identified With Ischemic Heart Disease',
 'Percent (%) of Beneficiaries Identified With Osteoporosis',
 'Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis',
 'Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders',
 'Percent (%) of Beneficiaries Identified With Stroke']

In [45]:
disease_cols.append('provider_id')
disease_cols

['Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia',
 'Percent (%) of Beneficiaries Identified With Asthma',
 'Percent (%) of Beneficiaries Identified With Atrial Fibrillation',
 'Percent (%) of Beneficiaries Identified With Cancer',
 'Percent (%) of Beneficiaries Identified With Chronic Kidney Disease',
 'Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease',
 'Percent (%) of Beneficiaries Identified With Depression',
 'Percent (%) of Beneficiaries Identified With Diabetes',
 'Percent (%) of Beneficiaries Identified With Heart Failure',
 'Percent (%) of Beneficiaries Identified With Hyperlipidemia',
 'Percent (%) of Beneficiaries Identified With Hypertension',
 'Percent (%) of Beneficiaries Identified With Ischemic Heart Disease',
 'Percent (%) of Beneficiaries Identified With Osteoporosis',
 'Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis',
 'Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders',
 'Percent (%) of Beneficiaries Identified With Stroke',
 'provider_id']

In [46]:
# disease reference table

disease_df = test[disease_cols]

disease_df.head()

,Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia,Percent (%) of Beneficiaries Identified With Asthma,Percent (%) of Beneficiaries Identified With Atrial Fibrillation,Percent (%) of Beneficiaries Identified With Cancer,Percent (%) of Beneficiaries Identified With Chronic Kidney Disease,Percent (%) of Beneficiaries Identified With Chronic Obstructive Pulmonary Disease,Percent (%) of Beneficiaries Identified With Depression,Percent (%) of Beneficiaries Identified With Diabetes,Percent (%) of Beneficiaries Identified With Heart Failure,Percent (%) of Beneficiaries Identified With Hyperlipidemia,Percent (%) of Beneficiaries Identified With Hypertension,Percent (%) of Beneficiaries Identified With Ischemic Heart Disease,Percent (%) of Beneficiaries Identified With Osteoporosis,Percent (%) of Beneficiaries Identified With Rheumatoid Arthritis / Osteoarthritis,Percent (%) of Beneficiaries Identified With Schizophrenia / Other Psychotic Disorders,Percent (%) of Beneficiaries Identified With Stroke,provider_id
0,34.000,10.000,24.000,18.000,59.000,41.000,40.000,51.000,53.000,65.000,75.000,66.000,14.000,47.000,14.000,19.000,1003000126
1,6.000,5.000,12.000,12.000,15.000,9.000,11.000,21.000,13.000,55.000,59.000,31.000,8.000,36.000,2.000,4.000,1003000134
2,15.000,14.000,9.000,12.000,34.000,30.000,43.000,50.000,31.000,63.000,75.000,47.000,13.000,75.000,nan,nan,1003000142
3,nan,nan,nan,nan,nan,nan,nan,35.000,nan,75.000,75.000,52.000,nan,58.000,0.000,nan,1003000381
4,40.000,7.000,25.000,19.000,46.000,43.000,50.000,39.000,51.000,65.000,75.000,65.000,20.000,41.000,21.000,12.000,1003000407

In [47]:
# going from wide to long data
disease_df = disease_df.melt(id_vars='provider_id', value_name='percent_of_beneficiaries', var_name='disease')
disease_df.head()

,provider_id,disease,percent_of_beneficiaries
0,1003000126,Percent (%) of Beneficiaries Identified With A...,34.000
1,1003000134,Percent (%) of Beneficiaries Identified With A...,6.000
2,1003000142,Percent (%) of Beneficiaries Identified With A...,15.000
3,1003000381,Percent (%) of Beneficiaries Identified With A...,nan
4,1003000407,Percent (%) of Beneficiaries Identified With A...,40.000

In [48]:
# extract disease info from 'Percent (%) of Beneficiaries Identified With Alzheimerâ€™s Disease or Dementia'
# use escape sign '\' before parenthesis
disease_df['disease'] = disease_df.disease.str.replace("Percent \(%\) of Beneficiaries Identified With ", "")
disease_df.head()

   provider_id                          disease  percent_of_beneficiaries
0   1003000126  Alzheimerâ€™s Disease or Dementia                    34.000
1   1003000134  Alzheimerâ€™s Disease or Dementia                     6.000
2   1003000142  Alzheimerâ€™s Disease or Dementia                    15.000
3   1003000381  Alzheimerâ€™s Disease or Dementia                       nan
4   1003000407  Alzheimerâ€™s Disease or Dementia                    40.000

In [49]:
disease_df.head()

   provider_id                          disease  percent_of_beneficiaries
0   1003000126  Alzheimerâ€™s Disease or Dementia                    34.000
1   1003000134  Alzheimerâ€™s Disease or Dementia                     6.000
2   1003000142  Alzheimerâ€™s Disease or Dementia                    15.000
3   1003000381  Alzheimerâ€™s Disease or Dementia                       nan
4   1003000407  Alzheimerâ€™s Disease or Dementia                    40.000

In [50]:
# step 1: assign unique disease_id 
disease_df = disease_df.assign(disease_id=(disease_df['disease'].astype('category').cat.codes))
disease_df.head()

,provider_id,disease,percent_of_beneficiaries,disease_id
0,1003000126,Alzheimerâ€™s Disease or Dementia,34.000,0
1,1003000134,Alzheimerâ€™s Disease or Dementia,6.000,0
2,1003000142,Alzheimerâ€™s Disease or Dementia,15.000,0
3,1003000381,Alzheimerâ€™s Disease or Dementia,nan,0
4,1003000407,Alzheimerâ€™s Disease or Dementia,40.000,0

In [51]:
# step 2: break disease_df into disease table and beneficiary_disease_info table

disease = disease_df[['disease_id','disease']].drop_duplicates()
disease = disease.dropna()

In [53]:
disease.to_sql(name='disease', con=engine, if_exists='append', index=False)

## Beneficiary_disease_info tableÂ¶

In [52]:
# for each provider_id, the percentages don't add up to 100%, because one beneficiary can have multiple disease 
# at the same time
beneficiary_disease_info = disease_df[['provider_id','disease_id','percent_of_beneficiaries']].drop_duplicates()
beneficiary_disease_info = beneficiary_disease_info.dropna()
beneficiary_disease_info.sort_values(by = 'provider_id')

        provider_id  disease_id  percent_of_beneficiaries
0        1003000126           0                    34.000
40000    1003000126           4                    59.000
50000    1003000126           5                    41.000
70000    1003000126           7                    51.000
90000    1003000126           9                    65.000
120000   1003000126          12                    14.000
30000    1003000126           3                    18.000
140000   1003000126          14                    14.000
100000   1003000126          10                    75.000
60000    1003000126           6                    40.000
130000   1003000126          13                    47.000
110000   1003000126          11                    66.000
20000    1003000126           2                    24.000
80000    1003000126           8                    53.000
10000    1003000126           1                    10.000
150000   1003000126          15                    19.000
10001    1003000134           1                     5.000
60001    1003000134           6                    11.000
40001    1003000134           4                    15.000
140001   1003000134          14                     2.000
30001    1003000134           3                    12.000
130001   1003000134          13                    36.000
90001    1003000134           9                    55.000
20001    1003000134           2                    12.000
50001    1003000134           5                     9.000
80001    1003000134           8                    13.000
70001    1003000134           7                    21.000
100001   1003000134          10                    59.000
150001   1003000134          15                     4.000
1        1003000134           0                     6.000
...             ...         ...                       ...
89998    1013019025           8                    20.000
159998   1013019025          15                     7.000
69998    1013019025           6                    11.000
99998    1013019025           9                    72.000
59998    1013019025           5                    17.000
79998    1013019025           7                    53.000
49998    1013019025           4                    24.000
109998   1013019025          10                    75.000
119998   1013019025          11                    54.000
129998   1013019025          12                     5.000
39998    1013019025           3                    11.000
139998   1013019025          13                    45.000
9998     1013019025           0                    10.000
19998    1013019025           1                     6.000
49999    1013019033           4                    27.000
39999    1013019033           3                    11.000
59999    1013019033           5                    31.000
69999    1013019033           6                    28.000
19999    1013019033           1                    10.000
139999   1013019033          13                    49.000
149999   1013019033          14                     6.000
89999    1013019033           8                    36.000
29999    1013019033           2                    12.000
99999    1013019033           9                    59.000
109999   1013019033          10                    75.000
9999     1013019033           0                    18.000
119999   1013019033          11                    46.000
129999   1013019033          12                    12.000
79999    1013019033           7                    38.000
159999   1013019033          15                     8.000

[119751 rows x 3 columns]

In [54]:
beneficiary_disease_info.to_sql(name='beneficiary_disease_info', con=engine, if_exists='append', index=False)

# Gender table + Beneficiary_gender_info table

## Gender Table

In [55]:
# find all related columns
all_cols = [line for line in list(test.columns) if re.search("Number of .* Beneficiaries$",line)]
gender_cols = all_cols[1:3]
gender_cols

['Number of Female Beneficiaries', 'Number of Male Beneficiaries']

In [56]:
gender_cols.append('provider_id')
gender_cols

['Number of Female Beneficiaries',
 'Number of Male Beneficiaries',
 'provider_id']

In [57]:
# gender reference table

gender_df = test[gender_cols]
gender_df.head()

   Number of Female Beneficiaries  Number of Male Beneficiaries  provider_id
0                         309.000                       272.000   1003000126
1                        1927.000                      1897.000   1003000134
2                          71.000                        48.000   1003000142
3                          17.000                        14.000   1003000381
4                         251.000                       193.000   1003000407

In [58]:
# going from wide to long data
gender_df = gender_df.melt(id_vars='provider_id', value_name='num_beneficiaries', var_name='gender')
gender_df.head()

   provider_id                          gender  num_beneficiaries
0   1003000126  Number of Female Beneficiaries            309.000
1   1003000134  Number of Female Beneficiaries           1927.000
2   1003000142  Number of Female Beneficiaries             71.000
3   1003000381  Number of Female Beneficiaries             17.000
4   1003000407  Number of Female Beneficiaries            251.000

In [59]:
# extract gender info from 'Number of Female Beneficiaries'
gender_df['gender'] = gender_df.gender.str.replace("Number of ", "")
gender_df['gender'] = gender_df.gender.str.replace(" Beneficiaries", "")
gender_df.head()

   provider_id  gender  num_beneficiaries
0   1003000126  Female            309.000
1   1003000134  Female           1927.000
2   1003000142  Female             71.000
3   1003000381  Female             17.000
4   1003000407  Female            251.000

In [60]:
# step 1: assign unique gender_id 
gender_df = gender_df.assign(gender_id=(gender_df['gender'].astype('category').cat.codes))
gender_df.head()

   provider_id  gender  num_beneficiaries  gender_id
0   1003000126  Female            309.000          0
1   1003000134  Female           1927.000          0
2   1003000142  Female             71.000          0
3   1003000381  Female             17.000          0
4   1003000407  Female            251.000          0

In [61]:
# step 2: break gender_df into gender table and beneficiary_gender_info table

gender = gender_df[['gender_id','gender']]
gender = gender.drop_duplicates()
gender = gender.dropna()
gender

       gender_id  gender
0              0  Female
10000          1    Male

## Beneficiary_gender_info table

In [62]:
# create beneficiary_gender_info table
beneficiary_gender_info = gender_df[['provider_id','gender_id','num_beneficiaries']]
beneficiary_gender_info = beneficiary_gender_info.drop_duplicates()
beneficiary_gender_info = beneficiary_gender_info.dropna()
beneficiary_gender_info.sort_values(by = 'provider_id')

       provider_id  gender_id  num_beneficiaries
0       1003000126          0            309.000
10000   1003000126          1            272.000
10001   1003000134          1           1897.000
1       1003000134          0           1927.000
2       1003000142          0             71.000
10002   1003000142          1             48.000
3       1003000381          0             17.000
10003   1003000381          1             14.000
4       1003000407          0            251.000
10004   1003000407          1            193.000
10005   1003000423          1              0.000
5       1003000423          0             73.000
10007   1003000480          1             55.000
7       1003000480          0             59.000
10008   1003000522          1            250.000
8       1003000522          0            314.000
10009   1003000530          1            142.000
9       1003000530          0            188.000
10011   1003000621          1             44.000
11      1003000621          0             74.000
10013   1003000704          1             30.000
13      1003000704          0             65.000
10014   1003000712          1             23.000
14      1003000712          0             24.000
15      1003000720          0             17.000
10015   1003000720          1             12.000
16      1003000738          0             31.000
10016   1003000738          1             24.000
17      1003000902          0            213.000
10017   1003000902          1            124.000
...            ...        ...                ...
19985   1013018704          1            129.000
9985    1013018704          0            171.000
9986    1013018761          0            235.000
19986   1013018761          1            197.000
19987   1013018795          1            131.000
9987    1013018795          0            191.000
19988   1013018829          1             13.000
9988    1013018829          0             43.000
19989   1013018837          1             48.000
9989    1013018837          0             84.000
19990   1013018845          1             62.000
9990    1013018845          0             46.000
19991   1013018886          1              0.000
9991    1013018886          0            179.000
19992   1013018894          1             38.000
9992    1013018894          0             50.000
19993   1013018902          1              0.000
9993    1013018902          0             60.000
9994    1013018944          0             11.000
19994   1013018944          1             15.000
19995   1013018993          1            142.000
9995    1013018993          0            214.000
19996   1013019009          1            301.000
9996    1013019009          0            389.000
19997   1013019017          1            159.000
9997    1013019017          0            177.000
19998   1013019025          1            171.000
9998    1013019025          0            239.000
9999    1013019033          0            669.000
19999   1013019033          1            442.000

[17832 rows x 3 columns]

In [99]:
# convert to sql
gender.to_sql(name='gender', con=engine, if_exists='append', index=False)

In [64]:
# convert to sql
beneficiary_gender_info.to_sql(name='beneficiary_gender_info', con=engine, if_exists='append', index=False)

# Index_type and Provider_index table

# Index_type table

In [65]:
index_cols = ['provider_id','Average HCC Risk Score of Beneficiaries','Medicare Participation Indicator']
index_df = test[index_cols]
index_df.head()

,provider_id,Average HCC Risk Score of Beneficiaries,Medicare Participation Indicator
0,1003000126,2.226,Y
1,1003000134,1.070,Y
2,1003000142,1.897,Y
3,1003000381,1.269,Y
4,1003000407,1.817,Y

In [66]:
# since there's no nan in the index_cols, we don't need to use fillna()
test[index_cols].isnull().sum()

provider_id                                0
Average HCC Risk Score of Beneficiaries    0
Medicare Participation Indicator           0
dtype: int64

In [67]:
# going from wide to long data
index_df = index_df.melt(id_vars='provider_id', value_name='index_value', var_name='index_type')
index_df.head()

   provider_id                               index_type index_value
0   1003000126  Average HCC Risk Score of Beneficiaries       2.226
1   1003000134  Average HCC Risk Score of Beneficiaries       1.070
2   1003000142  Average HCC Risk Score of Beneficiaries       1.897
3   1003000381  Average HCC Risk Score of Beneficiaries       1.269
4   1003000407  Average HCC Risk Score of Beneficiaries       1.817

In [68]:
# extract index name info from 'Average HCC Risk Score of Beneficiaries'
index_df['index_type'] = index_df.index_type.str.replace(" of Beneficiaries", "")
index_df.head()

   provider_id              index_type index_value
0   1003000126  Average HCC Risk Score       2.226
1   1003000134  Average HCC Risk Score       1.070
2   1003000142  Average HCC Risk Score       1.897
3   1003000381  Average HCC Risk Score       1.269
4   1003000407  Average HCC Risk Score       1.817

In [69]:
# step 1: assign unique index_id based on each unique entry
index_df = index_df.assign(index_id=(index_df['index_type'].astype('category').cat.codes))
index_df.head()

   provider_id              index_type index_value  index_id
0   1003000126  Average HCC Risk Score       2.226         0
1   1003000134  Average HCC Risk Score       1.070         0
2   1003000142  Average HCC Risk Score       1.897         0
3   1003000381  Average HCC Risk Score       1.269         0
4   1003000407  Average HCC Risk Score       1.817         0

In [70]:
# step 2: break index_df into index table and provider_index_info table
index_type = index_df[['index_id','index_type']].drop_duplicates()
index_type = index_type.drop_duplicates()
index_type = index_type.dropna()
index_type.head()

       index_id                        index_type
0             0            Average HCC Risk Score
10000         1  Medicare Participation Indicator

## Provider_index table

In [71]:
# step 3: create provider_index_info table
provider_index_info = index_df[['provider_id','index_id','index_value']]
provider_index_info.sort_values(by = 'provider_id')

       provider_id  index_id index_value
0       1003000126         0       2.226
10000   1003000126         1           Y
10001   1003000134         1           Y
1       1003000134         0       1.070
2       1003000142         0       1.897
10002   1003000142         1           Y
3       1003000381         0       1.269
10003   1003000381         1           Y
4       1003000407         0       1.817
10004   1003000407         1           Y
10005   1003000423         1           Y
5       1003000423         0       1.052
10006   1003000449         1           Y
6       1003000449         0       2.151
10007   1003000480         1           Y
7       1003000480         0       1.710
10008   1003000522         1           Y
8       1003000522         0       1.221
10009   1003000530         1           Y
9       1003000530         0       1.065
10010   1003000605         1           Y
10      1003000605         0       1.715
10011   1003000621         1           Y
11      1003000621         0       0.856
12      1003000639         0       2.219
10012   1003000639         1           Y
13      1003000704         0       1.663
10013   1003000704         1           Y
14      1003000712         0       4.039
10014   1003000712         1           Y
...            ...       ...         ...
19985   1013018704         1           Y
9985    1013018704         0       1.794
9986    1013018761         0       2.550
19986   1013018761         1           Y
19987   1013018795         1           Y
9987    1013018795         0       0.995
19988   1013018829         1           Y
9988    1013018829         0       1.210
19989   1013018837         1           Y
9989    1013018837         0       0.999
19990   1013018845         1           Y
9990    1013018845         0       1.908
19991   1013018886         1           Y
9991    1013018886         0       1.025
19992   1013018894         1           Y
9992    1013018894         0       0.983
19993   1013018902         1           Y
9993    1013018902         0       0.869
9994    1013018944         0       1.100
19994   1013018944         1           Y
19995   1013018993         1           Y
9995    1013018993         0       1.142
19996   1013019009         1           Y
9996    1013019009         0       1.124
19997   1013019017         1           Y
9997    1013019017         0       2.030
19998   1013019025         1           Y
9998    1013019025         0       1.321
9999    1013019033         0       1.601
19999   1013019033         1           Y

[20000 rows x 3 columns]

In [72]:
# step 4: recode index_value for participation index (Y:1, N:0)
provider_index_info = provider_index_info.replace({'Y':1, 'N':0})
provider_index_info = provider_index_info.drop_duplicates()
provider_index_info = provider_index_info.dropna()
provider_index_info.head()

   provider_id  index_id  index_value
0   1003000126         0        2.226
1   1003000134         0        1.070
2   1003000142         0        1.897
3   1003000381         0        1.269
4   1003000407         0        1.817

In [100]:
# convert to sql
index_type.to_sql(name='index_type', con=engine, if_exists='append', index=False)

In [74]:
# convert to sql
provider_index_info.to_sql(name='provider_index_info', con=engine, if_exists='append', index=False)

## Service_type and Provider_service

# Service_type Table

In [75]:
test=test.rename(columns={"Number of HCPCS":"num_of_HCPCS",
                         "Number of Services":"num_of_services",
                         "Number of HCPCS Associated With Drug Services":"HCPCS_drugservices",
                         "Number of Drug Services":"num_of_drugservices"})

In [76]:
# drop duplicates 
service_df=test[['provider_id',
                          'num_of_HCPCS',
                          'num_of_services',
                          'HCPCS_drugservices',
                          'num_of_drugservices']]

In [77]:
service_df = service_df.drop_duplicates()

In [78]:
# going from wide to long data
service_df = service_df.melt(id_vars='provider_id', value_name='service_amount', var_name='service_type')
service_df.head()

   provider_id  service_type  service_amount
0   1003000126  num_of_HCPCS          16.000
1   1003000134  num_of_HCPCS          12.000
2   1003000142  num_of_HCPCS          69.000
3   1003000381  num_of_HCPCS          10.000
4   1003000407  num_of_HCPCS          31.000

In [79]:
# Create temporary dataframe with unique payment type
service_type = pd.DataFrame(service_df.service_type.unique(), columns=['service_type'])

# Add serive_id
service_type.insert(0, 'service_id', range(1, 1 + len(service_type)))

service_type.head()

   service_id         service_type
0           1         num_of_HCPCS
1           2      num_of_services
2           3   HCPCS_drugservices
3           4  num_of_drugservices

In [80]:
# Map service_id
service_id_list = [service_type.service_id[service_type.service_type == i].values[0] for i in service_df.service_type]

# Add service_id to the service_df
service_df.insert(2, 'service_id', service_id_list)

In [81]:
service_df.head()

   provider_id  service_type  service_id  service_amount
0   1003000126  num_of_HCPCS           1          16.000
1   1003000134  num_of_HCPCS           1          12.000
2   1003000142  num_of_HCPCS           1          69.000
3   1003000381  num_of_HCPCS           1          10.000
4   1003000407  num_of_HCPCS           1          31.000

In [82]:
# Create service_types
service_type= service_df[['service_id','service_type']]
service_type= service_type.drop_duplicates()
service_type= service_type.dropna()
service_type.head()

       service_id         service_type
0               1         num_of_HCPCS
10000           2      num_of_services
20000           3   HCPCS_drugservices
30000           4  num_of_drugservices

## Provider_serviceÂ¶

In [83]:
# Create provider_service
provider_service= service_df[['service_id','provider_id', 'service_amount']]
provider_service= provider_service.drop_duplicates()
provider_service= provider_service.dropna()
provider_service.head()

   service_id  provider_id  service_amount
0           1   1003000126          16.000
1           1   1003000134          12.000
2           1   1003000142          69.000
3           1   1003000381          10.000
4           1   1003000407          31.000

In [101]:
# convert to sql
service_type.to_sql(name='service_type', con=engine, if_exists='append', index=False)

In [85]:
# convert to sql
provider_service.to_sql(name='provider_service', con=engine, if_exists='append', index=False)

# Final tables

In [119]:
for table in [provider_info,
              credential,
              provider_credential,
              address,
              provider_address,
              amount,
              amount_type,
              age,
              beneficiary_age_info,
              ethnicity,
              beneficiary_ethnicity_info,
              disease,
              beneficiary_disease_info,
              gender,
              beneficiary_gender_info,
              service_type,
              provider_service,
              index_type,
              provider_index_info:
    print(table.columns)

Index(['provider_id', 'last name', 'First Name', 'gender', 'entity code',
       'num_of_unique_beneficiaries'],
      dtype='object')
Index(['credential_id', 'credential_type'], dtype='object')
Index(['provider_id', 'credential_id'], dtype='object')
Index(['address_id', 'address', 'city', 'zip code', 'state', 'country'], dtype='object')
Index(['provider_id', 'address_id'], dtype='object')
Index(['provider_id', 'amount_type_id', 'value'], dtype='object')
Index(['amount_type_id', 'description'], dtype='object')
Index(['age_id', 'age_group'], dtype='object')
Index(['provider_id', 'age_id', 'num_beneficiaries'], dtype='object')
Index(['ethnicity_id', 'ethnicity'], dtype='object')
Index(['provider_id', 'ethnicity_id', 'num_beneficiaries'], dtype='object')
Index(['disease_id', 'disease'], dtype='object')
Index(['provider_id', 'disease_id', 'percent_of_beneficiaries'], dtype='object')
Index(['gender_id', 'gender'], dtype='object')
Index(['provider_id', 'gender_id', 'num_beneficiaries'], dtype='object')
Index(['provider_id', 'num_of_HCPCS', 'num_of_services', 'HCPCS_drugservices',
       'num_of_drugservices'],
      dtype='object')

# Convert into sql

In [ ]:
#convert to sql
provider_info.to_sql(name='provider_info', con=engine, if_exists='append', index=False)

credential.to_sql(name='credential', con=engine, if_exists='append', index=False)
provider_credential.to_sql(name='provider_credential', con=engine, if_exists='append', index=False)

address.to_sql(name='address', con=engine, if_exists='append', index=False)
provider_address(name='provider_address', con=engine, if_exists='append', index=False)

amount_type.to_sql(name='amount_type', con=engine, if_exists='append', index=False)
amount.to_sql(name='amount', con=engine, if_exists='append', index=False)

age.to_sql(name='age', con=engine, if_exists='append', index=False)
beneficiary_age_info.to_sql(name='beneficiary_age_info', con=engine, if_exists='append', index=False)

ethnicity.to_sql(name='ethnicity', con=engine, if_exists='append', index=False)
beneficiary_ethnicity_info.to_sql(name='beneficiary_ethnicity_info', con=engine, if_exists='append', index=False)

gender.to_sql(name='gender', con=engine, if_exists='append', index=False)
beneficiary_gender_info.to_sql(name='beneficiary_gender_info', con=engine, if_exists='append', index=False)

disease.to_sql(name='disease', con=engine, if_exists='append', index=False)
beneficiary_disease_info.to_sql(name='beneficiary_disease_info', con=engine, if_exists='append', index=False)

service_type.to_sql(name='service_type', con=engine, if_exists='append', index=False)
provider_service.to_sql(name='provider_service', con=engine, if_exists='append', index=False)

provider_misc_index.to_sql(name='provider_misc_index', con=engine, if_exists='append', index=False)